// Задание/сложность 3 из переменных и тд
let planet = "Zemlya"; // Сделал так в самом начале
let name = "Jon"; // Сделал так в самом начале
// после я посмотрел решение и исправил ошибки
let ourPlanetName = "Zemlyaa";
let currentUserName = "Jonn";

// Задание/сложность 4 так же из переменных
// Вопрос был можно ли записать две переменные в верхнем регистре, я думаю что обще можно
const birthday = "18.04.1982";

const age = someCode(birthday);
// Но оказалось что можно только записать заглавно дату рождения, так как она постоянна и не меняется.
// А вот уже год не постоянный, поэтому пишем в нижнем регистре
